; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l8-t1-p2---int100n150-m25---int100c200---s58---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level12 level12)
(sum level0 level14 level14)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level18 level18)
(sum level0 level25 level25)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level12 level13)
(sum level1 level14 level15)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level18 level19)
(sum level1 level25 level26)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level12 level14)
(sum level2 level14 level16)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level18 level20)
(sum level2 level25 level27)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level12 level15)
(sum level3 level14 level17)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level18 level21)
(sum level3 level25 level28)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level12 level16)
(sum level4 level14 level18)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level18 level22)
(sum level4 level25 level29)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level12 level17)
(sum level5 level14 level19)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level18 level23)
(sum level5 level25 level30)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level12 level18)
(sum level6 level14 level20)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level18 level24)
(sum level6 level25 level31)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level12 level19)
(sum level7 level14 level21)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level18 level25)
(sum level7 level25 level32)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level12 level20)
(sum level8 level14 level22)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level18 level26)
(sum level8 level25 level33)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level12 level21)
(sum level9 level14 level23)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level18 level27)
(sum level9 level25 level34)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level12 level22)
(sum level10 level14 level24)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level18 level28)
(sum level10 level25 level35)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level12 level23)
(sum level11 level14 level25)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level18 level29)
(sum level11 level25 level36)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level12 level24)
(sum level12 level14 level26)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level18 level30)
(sum level12 level25 level37)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level12 level25)
(sum level13 level14 level27)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level18 level31)
(sum level13 level25 level38)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level12 level26)
(sum level14 level14 level28)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level18 level32)
(sum level14 level25 level39)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level12 level27)
(sum level15 level14 level29)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level18 level33)
(sum level15 level25 level40)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level12 level28)
(sum level16 level14 level30)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level18 level34)
(sum level16 level25 level41)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level12 level29)
(sum level17 level14 level31)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level18 level35)
(sum level17 level25 level42)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level12 level30)
(sum level18 level14 level32)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level18 level36)
(sum level18 level25 level43)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level12 level31)
(sum level19 level14 level33)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level18 level37)
(sum level19 level25 level44)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level12 level32)
(sum level20 level14 level34)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level18 level38)
(sum level20 level25 level45)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level12 level33)
(sum level21 level14 level35)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level18 level39)
(sum level21 level25 level46)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level12 level34)
(sum level22 level14 level36)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level18 level40)
(sum level22 level25 level47)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level12 level35)
(sum level23 level14 level37)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level18 level41)
(sum level23 level25 level48)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level12 level36)
(sum level24 level14 level38)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level18 level42)
(sum level24 level25 level49)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level12 level37)
(sum level25 level14 level39)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level18 level43)
(sum level25 level25 level50)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level12 level38)
(sum level26 level14 level40)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level18 level44)
(sum level26 level25 level51)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level12 level39)
(sum level27 level14 level41)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level18 level45)
(sum level27 level25 level52)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level12 level40)
(sum level28 level14 level42)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level18 level46)
(sum level28 level25 level53)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level12 level41)
(sum level29 level14 level43)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level18 level47)
(sum level29 level25 level54)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level12 level42)
(sum level30 level14 level44)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level18 level48)
(sum level30 level25 level55)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level12 level43)
(sum level31 level14 level45)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level18 level49)
(sum level31 level25 level56)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level12 level44)
(sum level32 level14 level46)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level18 level50)
(sum level32 level25 level57)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level12 level45)
(sum level33 level14 level47)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level18 level51)
(sum level33 level25 level58)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level12 level46)
(sum level34 level14 level48)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level34 level18 level52)
(sum level34 level25 level59)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level12 level47)
(sum level35 level14 level49)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level35 level18 level53)
(sum level35 level25 level60)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level12 level48)
(sum level36 level14 level50)
(sum level36 level15 level51)
(sum level36 level16 level52)
(sum level36 level18 level54)
(sum level36 level25 level61)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level12 level49)
(sum level37 level14 level51)
(sum level37 level15 level52)
(sum level37 level16 level53)
(sum level37 level18 level55)
(sum level37 level25 level62)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level12 level50)
(sum level38 level14 level52)
(sum level38 level15 level53)
(sum level38 level16 level54)
(sum level38 level18 level56)
(sum level38 level25 level63)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level12 level51)
(sum level39 level14 level53)
(sum level39 level15 level54)
(sum level39 level16 level55)
(sum level39 level18 level57)
(sum level39 level25 level64)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level12 level52)
(sum level40 level14 level54)
(sum level40 level15 level55)
(sum level40 level16 level56)
(sum level40 level18 level58)
(sum level40 level25 level65)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level12 level53)
(sum level41 level14 level55)
(sum level41 level15 level56)
(sum level41 level16 level57)
(sum level41 level18 level59)
(sum level41 level25 level66)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level12 level54)
(sum level42 level14 level56)
(sum level42 level15 level57)
(sum level42 level16 level58)
(sum level42 level18 level60)
(sum level42 level25 level67)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level12 level55)
(sum level43 level14 level57)
(sum level43 level15 level58)
(sum level43 level16 level59)
(sum level43 level18 level61)
(sum level43 level25 level68)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level12 level56)
(sum level44 level14 level58)
(sum level44 level15 level59)
(sum level44 level16 level60)
(sum level44 level18 level62)
(sum level44 level25 level69)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level12 level57)
(sum level45 level14 level59)
(sum level45 level15 level60)
(sum level45 level16 level61)
(sum level45 level18 level63)
(sum level45 level25 level70)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level12 level58)
(sum level46 level14 level60)
(sum level46 level15 level61)
(sum level46 level16 level62)
(sum level46 level18 level64)
(sum level46 level25 level71)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level12 level59)
(sum level47 level14 level61)
(sum level47 level15 level62)
(sum level47 level16 level63)
(sum level47 level18 level65)
(sum level47 level25 level72)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level12 level60)
(sum level48 level14 level62)
(sum level48 level15 level63)
(sum level48 level16 level64)
(sum level48 level18 level66)
(sum level48 level25 level73)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level12 level61)
(sum level49 level14 level63)
(sum level49 level15 level64)
(sum level49 level16 level65)
(sum level49 level18 level67)
(sum level49 level25 level74)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level12 level62)
(sum level50 level14 level64)
(sum level50 level15 level65)
(sum level50 level16 level66)
(sum level50 level18 level68)
(sum level50 level25 level75)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level12 level63)
(sum level51 level14 level65)
(sum level51 level15 level66)
(sum level51 level16 level67)
(sum level51 level18 level69)
(sum level51 level25 level76)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level12 level64)
(sum level52 level14 level66)
(sum level52 level15 level67)
(sum level52 level16 level68)
(sum level52 level18 level70)
(sum level52 level25 level77)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level12 level65)
(sum level53 level14 level67)
(sum level53 level15 level68)
(sum level53 level16 level69)
(sum level53 level18 level71)
(sum level53 level25 level78)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level12 level66)
(sum level54 level14 level68)
(sum level54 level15 level69)
(sum level54 level16 level70)
(sum level54 level18 level72)
(sum level54 level25 level79)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level55 level12 level67)
(sum level55 level14 level69)
(sum level55 level15 level70)
(sum level55 level16 level71)
(sum level55 level18 level73)
(sum level55 level25 level80)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level56 level12 level68)
(sum level56 level14 level70)
(sum level56 level15 level71)
(sum level56 level16 level72)
(sum level56 level18 level74)
(sum level56 level25 level81)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level8 level65)
(sum level57 level12 level69)
(sum level57 level14 level71)
(sum level57 level15 level72)
(sum level57 level16 level73)
(sum level57 level18 level75)
(sum level57 level25 level82)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level58 level8 level66)
(sum level58 level12 level70)
(sum level58 level14 level72)
(sum level58 level15 level73)
(sum level58 level16 level74)
(sum level58 level18 level76)
(sum level58 level25 level83)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level59 level8 level67)
(sum level59 level12 level71)
(sum level59 level14 level73)
(sum level59 level15 level74)
(sum level59 level16 level75)
(sum level59 level18 level77)
(sum level59 level25 level84)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level60 level8 level68)
(sum level60 level12 level72)
(sum level60 level14 level74)
(sum level60 level15 level75)
(sum level60 level16 level76)
(sum level60 level18 level78)
(sum level60 level25 level85)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level61 level8 level69)
(sum level61 level12 level73)
(sum level61 level14 level75)
(sum level61 level15 level76)
(sum level61 level16 level77)
(sum level61 level18 level79)
(sum level61 level25 level86)
(sum level62 level6 level68)
(sum level62 level7 level69)
(sum level62 level8 level70)
(sum level62 level12 level74)
(sum level62 level14 level76)
(sum level62 level15 level77)
(sum level62 level16 level78)
(sum level62 level18 level80)
(sum level62 level25 level87)
(sum level63 level6 level69)
(sum level63 level7 level70)
(sum level63 level8 level71)
(sum level63 level12 level75)
(sum level63 level14 level77)
(sum level63 level15 level78)
(sum level63 level16 level79)
(sum level63 level18 level81)
(sum level63 level25 level88)
(sum level64 level6 level70)
(sum level64 level7 level71)
(sum level64 level8 level72)
(sum level64 level12 level76)
(sum level64 level14 level78)
(sum level64 level15 level79)
(sum level64 level16 level80)
(sum level64 level18 level82)
(sum level65 level6 level71)
(sum level65 level7 level72)
(sum level65 level8 level73)
(sum level65 level12 level77)
(sum level65 level14 level79)
(sum level65 level15 level80)
(sum level65 level16 level81)
(sum level65 level18 level83)
(sum level66 level6 level72)
(sum level66 level7 level73)
(sum level66 level8 level74)
(sum level66 level12 level78)
(sum level66 level14 level80)
(sum level66 level15 level81)
(sum level66 level16 level82)
(sum level66 level18 level84)
(sum level67 level6 level73)
(sum level67 level7 level74)
(sum level67 level8 level75)
(sum level67 level12 level79)
(sum level67 level14 level81)
(sum level67 level15 level82)
(sum level67 level16 level83)
(sum level67 level18 level85)
(sum level68 level6 level74)
(sum level68 level7 level75)
(sum level68 level8 level76)
(sum level68 level12 level80)
(sum level68 level14 level82)
(sum level68 level15 level83)
(sum level68 level16 level84)
(sum level68 level18 level86)
(sum level69 level6 level75)
(sum level69 level7 level76)
(sum level69 level8 level77)
(sum level69 level12 level81)
(sum level69 level14 level83)
(sum level69 level15 level84)
(sum level69 level16 level85)
(sum level69 level18 level87)
(sum level70 level6 level76)
(sum level70 level7 level77)
(sum level70 level8 level78)
(sum level70 level12 level82)
(sum level70 level14 level84)
(sum level70 level15 level85)
(sum level70 level16 level86)
(sum level70 level18 level88)
(sum level71 level6 level77)
(sum level71 level7 level78)
(sum level71 level8 level79)
(sum level71 level12 level83)
(sum level71 level14 level85)
(sum level71 level15 level86)
(sum level71 level16 level87)
(sum level72 level6 level78)
(sum level72 level7 level79)
(sum level72 level8 level80)
(sum level72 level12 level84)
(sum level72 level14 level86)
(sum level72 level15 level87)
(sum level72 level16 level88)
(sum level73 level6 level79)
(sum level73 level7 level80)
(sum level73 level8 level81)
(sum level73 level12 level85)
(sum level73 level14 level87)
(sum level73 level15 level88)
(sum level74 level6 level80)
(sum level74 level7 level81)
(sum level74 level8 level82)
(sum level74 level12 level86)
(sum level74 level14 level88)
(sum level75 level6 level81)
(sum level75 level7 level82)
(sum level75 level8 level83)
(sum level75 level12 level87)
(sum level76 level6 level82)
(sum level76 level7 level83)
(sum level76 level8 level84)
(sum level76 level12 level88)
(sum level77 level6 level83)
(sum level77 level7 level84)
(sum level77 level8 level85)
(sum level78 level6 level84)
(sum level78 level7 level85)
(sum level78 level8 level86)
(sum level79 level6 level85)
(sum level79 level7 level86)
(sum level79 level8 level87)
(sum level80 level6 level86)
(sum level80 level7 level87)
(sum level80 level8 level88)
(sum level81 level6 level87)
(sum level81 level7 level88)
(sum level82 level6 level88)

(connected l0 l1)
(fuelcost level14 l0 l1)
(connected l0 l2)
(fuelcost level15 l0 l2)
(connected l0 l5)
(fuelcost level25 l0 l5)
(connected l0 l7)
(fuelcost level8 l0 l7)
(connected l1 l0)
(fuelcost level14 l1 l0)
(connected l1 l2)
(fuelcost level7 l1 l2)
(connected l1 l4)
(fuelcost level6 l1 l4)
(connected l1 l7)
(fuelcost level18 l1 l7)
(connected l2 l0)
(fuelcost level15 l2 l0)
(connected l2 l1)
(fuelcost level7 l2 l1)
(connected l2 l4)
(fuelcost level14 l2 l4)
(connected l3 l7)
(fuelcost level16 l3 l7)
(connected l4 l1)
(fuelcost level6 l4 l1)
(connected l4 l2)
(fuelcost level14 l4 l2)
(connected l4 l5)
(fuelcost level8 l4 l5)
(connected l5 l0)
(fuelcost level25 l5 l0)
(connected l5 l4)
(fuelcost level8 l5 l4)
(connected l5 l7)
(fuelcost level6 l5 l7)
(connected l6 l7)
(fuelcost level12 l6 l7)
(connected l7 l0)
(fuelcost level8 l7 l0)
(connected l7 l1)
(fuelcost level18 l7 l1)
(connected l7 l3)
(fuelcost level16 l7 l3)
(connected l7 l5)
(fuelcost level6 l7 l5)
(connected l7 l6)
(fuelcost level12 l7 l6)

(at t0 l0)
(fuel t0 level88)
(= (total-cost) 0)

(at p0 l0)
(at p1 l7)
)

(:goal
(and
(at p0 l1)
(at p1 l6)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 2
2. (drive t0 l0 l1 level74 level14 level88)
   deleted: (at t0 l0) (fuel t0 level88)
   added: (at t0 l1) (fuel t0 level74)
   goals met: 0 of 2
3. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 2
4. (drive t0 l1 l7 level56 level18 level74)
   deleted: (at t0 l1) (fuel t0 level74)
   added: (at t0 l7) (fuel t0 level56)
   goals met: 1 of 2
5. (load p1 t0 l7)
   deleted: (at p1 l7)
   added: (in p1 t0)
   goals met: 1 of 2
6. (drive t0 l7 l6 level44 level12 level56)
   deleted: (at t0 l7) (fuel t0 level56)
   added: (at t0 l6) (fuel t0 level44)
   goals met: 1 of 2
7. (unload p1 t0 l6)
   deleted: (in p1 t0)
   added: (at p1 l6)
   goals met: 2 of 2
